Revit 2024 API
BuiltInFailures.LevelFailures.StoryAboveDeleted Property
 The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StoryAboveDeleted { get; }
Visual Basic
Public Shared ReadOnly Property StoryAboveDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StoryAboveDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace